Tekla Open API Reference for Tekla Structures 2025
TextFile.Attributes Property
 Gets or sets the text file attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TextFile.TextFileAttributes Attributes { get; set; }
Public Property Attributes As TextFile.TextFileAttributes
	Get
	Set
Property Value
Type: TextFile.TextFileAttributes
See Also
Reference
TextFile Class
Tekla.Structures.Drawing Namespace